Repository: jwobarros/personal-expense-control
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: pt_br

# no_categories_registered
source: You don't have any categories registered.
pt_br: Você não tem nenhuma categoria registrada.

# new_category
source: Use /add_category <categorie_name> to add a new category.
pt_br: Utilize /add_category <categoria> para adicionar uma nova categoria.

# category_already_exists
source: The category {category_name} already exists.
pt_br: A categoria {category_name} já existe.

# remove_category_command
source: Use /remove_category <category> to delete a category.
pt_br: Use /remove_category <categoria> para deletar uma categoria.

# category_deleted_notification
source: The category {category.name} has been deleted.
pt_br: A categoria {category.name} foi deletada.

# category_not_found_error
source: The category does not exist.
pt_br: A categoria não existe.

# set_limit_command
source: Use /set_limit <category> <limit_amount> to set a spending limit for a category.
pt_br: Use /set_limit <categoria> <limite> para definir um limite de gastos para uma categoria.

# invalid_value_error
source: Error in the value provided, please enter a valid value.
pt_br: Erro no valor fornecido, por favor digite um valor válido.

# incomes_command
source: Use /incomes <month-year: Optional> to show the recorded incomes for the month.
pt_br: Use /incomes <mês-ano: Opcional> para mostrar os rendimentos registrados para o mês.

# add_income_command
source: Use /add_income <category> <amount> to add a new income.
pt_br: Use /add_income <categoria> <valor> para adicionar um novo rendimento.

# income_added_notification
source: Value added to the category {category_name}.
pt_br: Valor adicionado à categoria {category_name}.

# remove_income_command
source: Use /remove_income <income_id> to delete an income.
pt_br: Use /remove_income <id_do_rendimento> para deletar um rendimento.

# income_deleted_notification
source: The income {income_id} has been deleted.
pt_br: O rendimento {income_id} foi deletado.

# income_not_found_error
source: The income {income_id} does not exist.
pt_br: O rendimento {income_id} não existe.

# expenses_list
source: List of expenses ({month}-{year}): {expenses}
pt_br: Lista de gastos ({mês}-{ano}): {expenses}

# no_expenses_recorded
source: You don't have any expense recorded.
pt_br: Você não tem nenhum gasto registrado.

# add_expense_command
source: Use /add_expense <category> <amount> to add a new expense.
pt_br: Use /add_expense <categoria> <valor> para adicionar um novo gasto.

# remove_expense_command
source: Use /remove_expense <income_id> to delete an expense.
pt_br: Use /remove_expense <id_do_gasto> para deletar um gasto.

# expense_deleted_notification
source: The expense {expense_id} has been deleted.
pt_br: O gasto {expense_id} foi deletado.

# expense_not_found_error
source: The expense {expense_id} does not exist.
pt_br: O gasto {expense_id} não existe.

# report_command
source: Use /report <month-year: Optional> to generate the report of expenses for the month.
pt_br: Use /report <mês-ano: Opcional> para gerar o relatório de gastos para o mês.

# command_list
source: List of available commands for this bot: /start: Start a conversation with the bot. /help: Get help on how to use the bot and its available commands. /categories: View a list of your expense and income categories. /add_category <category>: Add a new expense or income category. /remove_category <category_id>: Remove an existing expense or income category. /set_limit <category> <limit_amount>: Set a spending limit for an expense category. /expenses <month-year: Optional>: View a list of your recorded expenses, default is current month-year. /add_expense <category> <amount>: Add a new expense. /remove_expense <expense_id>: Remove an existing expense. /incomes <month-year: Optional>: View a list of your recorded incomes, default is current month-year. /add_income <category> <amount>: Add a new income. /remove_income <income_id>: Remove an existing income. /report <month-year: Optional>: Shows a monthly report to expenses by category.
pt_br: Lista de comandos disponíveis para este bot: /start: Inicie uma conversa com o bot. /help: Obtenha ajuda sobre como usar o bot e seus comandos disponíveis. /categories: Visualize uma lista de suas categorias de despesas e receitas. /add_category <category>: Adicione uma nova categoria de despesa ou receita. /remove_category <category_id>: Remova uma categoria de despesa ou receita existente. /set_limit <category> <limit_amount>: Defina um limite de gastos para uma categoria de despesas. /expenses <month-year: Opcional>: Veja uma lista de suas despesas registradas, o padrão é o mês e ano atual. /add_expense <category> <amount>: Adicione uma nova despesa. /remove_expense <expense_id>: Remova uma despesa existente. /incomes <month-year: Opcional>: Veja uma lista de seus rendimentos registrados, o padrão é o mês e ano atual. /add_income <category> <amount>: Adicione uma nova renda. /remove_income <income_id>: Remova uma renda existente. /report <month-year: Opcional>: Mostra um relatório mensal de despesas por categoria.

# hello
source: Hi, {first_name}! I am your personal finance assistant. Type /help to see the list of available commands.
pt_br: Oi, {first_name}! Eu sou seu assistente pessoal de finanças. Digite /help para ver a lista de comandos disponíveis.

# expense_for_the_month
source: Expenses for the {year}-{month}
pt_br: Gastos do mês {month}-{year}
